; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v4 ?v2)
             (pred_11 ?v9 ?v7)
             (pred_7 ?v4 ?v7)
             (pred_1 ?v3 ?v4 )
	     (pred_3 ?v4)
             (pred_2 ?v1)
             (pred_4 ?v9)
             (pred_8 ?v7)
             (pred_10 ?v4)
             (pred_12 ?v9)
             (pred_6 ?v4)
             (pred_9 ))



(:action op_4
:parameters (?v5 ?v11 ?v13 ?v12)
:precondition (and (pred_2 ?v5) (pred_2 ?v11) (pred_4 ?v13) (pred_8 ?v12)
          (pred_5 ?v5 ?v11) (pred_11 ?v13 ?v12)
                   (pred_7 ?v11 ?v12) (pred_3 ?v5) 
                   (pred_10 ?v11) (pred_12 ?v13))
:effect (and  (pred_6 ?v11) (not (pred_10 ?v11))))


(:action op_1
:parameters (?v5 ?v6)
:precondition (and (pred_2 ?v5) (pred_2 ?v6)
               (pred_3 ?v5) (pred_5 ?v5 ?v6) (pred_6 ?v6))
:effect (and (pred_3 ?v6) (not (pred_3 ?v5))))

(:action op_2
:parameters (?v5 ?v13)
:precondition (and (pred_2 ?v5) (pred_4 ?v13) 
                  (pred_3 ?v5) (pred_1 ?v13 ?v5) (pred_9 ))
:effect (and (pred_12 ?v13)
   (not (pred_1 ?v13 ?v5)) (not (pred_9 ))))


(:action op_5
:parameters (?v5 ?v10 ?v8)
:precondition (and (pred_2 ?v5) (pred_4 ?v10) (pred_4 ?v8)
                  (pred_3 ?v5) (pred_12 ?v8) (pred_1 ?v10 ?v5))
:effect (and (pred_12 ?v10) (pred_1 ?v8 ?v5)
        (not (pred_12 ?v8)) (not (pred_1 ?v10 ?v5))))

(:action op_3
:parameters (?v5 ?v13)
:precondition (and (pred_2 ?v5) (pred_4 ?v13) 
                  (pred_3 ?v5) (pred_12 ?v13))
:effect (and (pred_9 ) (pred_1 ?v13 ?v5) (not (pred_12 ?v13)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_09 obj_16 obj_19 obj_07 obj_08 obj_21 obj_02 obj_22 obj_14 obj_11 obj_17 obj_05 obj_04 obj_12 obj_20
    obj_01 obj_10 obj_03
    obj_15 obj_06 obj_13
    )

    (:init
       (pred_9)

       (pred_2 obj_18)
       (pred_2 obj_09)
       (pred_2 obj_16)
       (pred_2 obj_19)
       (pred_2 obj_07)
       (pred_2 obj_08)
       (pred_2 obj_21)
       (pred_2 obj_02)
       (pred_2 obj_22)
       (pred_2 obj_14)
       (pred_2 obj_11)
       (pred_2 obj_17)
       (pred_2 obj_05)
       (pred_2 obj_04)
       (pred_2 obj_12)
       (pred_2 obj_20)
       (pred_8 obj_01)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_4 obj_15)
       (pred_4 obj_06)
       (pred_4 obj_13)

       (pred_5 obj_18 obj_07)
       (pred_5 obj_18 obj_09)
       (pred_5 obj_09 obj_08)
       (pred_5 obj_09 obj_16)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_16 obj_21)
       (pred_5 obj_16 obj_19)
       (pred_5 obj_16 obj_09)
       (pred_5 obj_19 obj_02)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_07 obj_22)
       (pred_5 obj_07 obj_08)
       (pred_5 obj_07 obj_18)
       (pred_5 obj_08 obj_14)
       (pred_5 obj_08 obj_21)
       (pred_5 obj_08 obj_09)
       (pred_5 obj_08 obj_07)
       (pred_5 obj_21 obj_11)
       (pred_5 obj_21 obj_02)
       (pred_5 obj_21 obj_16)
       (pred_5 obj_21 obj_08)
       (pred_5 obj_02 obj_17)
       (pred_5 obj_02 obj_19)
       (pred_5 obj_02 obj_21)
       (pred_5 obj_22 obj_05)
       (pred_5 obj_22 obj_14)
       (pred_5 obj_22 obj_07)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_14 obj_11)
       (pred_5 obj_14 obj_08)
       (pred_5 obj_14 obj_22)
       (pred_5 obj_11 obj_12)
       (pred_5 obj_11 obj_17)
       (pred_5 obj_11 obj_21)
       (pred_5 obj_11 obj_14)
       (pred_5 obj_17 obj_20)
       (pred_5 obj_17 obj_02)
       (pred_5 obj_17 obj_11)
       (pred_5 obj_05 obj_04)
       (pred_5 obj_05 obj_22)
       (pred_5 obj_04 obj_12)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_04 obj_05)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_12 obj_11)
       (pred_5 obj_12 obj_04)
       (pred_5 obj_20 obj_17)
       (pred_5 obj_20 obj_12)
       (pred_10 obj_22)
       (pred_10 obj_04)
       (pred_10 obj_21)
       (pred_7  obj_22 obj_01)
       (pred_7  obj_04 obj_10)
       (pred_7  obj_21 obj_03)
       (pred_6 obj_18)
       (pred_6 obj_09)
       (pred_6 obj_16)
       (pred_6 obj_19)
       (pred_6 obj_07)
       (pred_6 obj_08)
       (pred_6 obj_02)
       (pred_6 obj_14)
       (pred_6 obj_11)
       (pred_6 obj_17)
       (pred_6 obj_05)
       (pred_6 obj_12)
       (pred_6 obj_20)

       (pred_11  obj_15 obj_01)
       (pred_11  obj_06 obj_10)
       (pred_11  obj_13 obj_03)
       (pred_1 obj_15 obj_02)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_13 obj_07)
       (pred_3 obj_07)
    )

    (:goal (and
       (pred_1 obj_06 obj_20)
    ))
(:constraints
  (always (not (pred_3 obj_11)))
)
)

; plan
1. (op_2 obj_07 obj_13)
   deleted: (pred_1 obj_13 obj_07) (pred_9)
   added: (pred_12 obj_13)
   goals met: 0 of 1
2. (op_1 obj_07 obj_08)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_08)
   goals met: 0 of 1
3. (op_4 obj_08 obj_21 obj_13 obj_03)
   deleted: (pred_10 obj_21)
   added: (pred_6 obj_21)
   goals met: 0 of 1
4. (op_3 obj_08 obj_13)
   deleted: (pred_12 obj_13)
   added: (pred_9) (pred_1 obj_13 obj_08)
   goals met: 0 of 1
5. (op_1 obj_08 obj_21)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_21)
   goals met: 0 of 1
6. (op_1 obj_21 obj_02)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_02)
   goals met: 0 of 1
7. (op_1 obj_02 obj_17)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_17)
   goals met: 0 of 1
8. (op_1 obj_17 obj_20)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_20)
   goals met: 0 of 1
9. (op_1 obj_20 obj_12)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_12)
   goals met: 0 of 1
10. (op_2 obj_12 obj_06)
   deleted: (pred_1 obj_06 obj_12) (pred_9)
   added: (pred_12 obj_06)
   goals met: 0 of 1
11. (op_1 obj_12 obj_20)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_20)
   goals met: 0 of 1
12. (op_3 obj_20 obj_06)
   deleted: (pred_12 obj_06)
   added: (pred_9) (pred_1 obj_06 obj_20)
   goals met: 1 of 1
